back/artillery/test.yml
config:
  target: 'http://localhost:8080'
  phases:
    - duration: 5
      arrivalRate: 5
      name: Warm up
  payload:
    path: 'users.csv'
    fields:
      - 'email'
      - 'password'
scenarios:
  - name: 'Log in and then go to products page'
    flow:
      - post:
          url: '/api/auth/login'
          json:
            email: '{{ email }}'
            password: '{{ password }}'
      - get:
          url: '/api/productos'